<?php
$allletters = array();
$en = array('a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z');
$allletters['English'] = $en;
//French
$allletters['French']= array( "é",  "è",  "ç", "à", "a", "z", "e", "r", "t", "y", "u", "i", "o", "p",  "$",  "q", "s", "d", "f", "g", "h", "j", "k", "l", "m", "ù",  "w", "x", "c", "v", "b", "n");

//dutch
$allletters['Dutch'] = array_merge( $en , array("ë","ÿ","ü","ï","ö","ä"));

//German
$allletters['German']= array("ß", "q", "w", "e", "r", "t", "z", "u", "i", "o", "p", "ü",  "a", "s", "d", "f", "g", "h", "j", "k", "l", "ö", "ä",  "y", "x", "c", "v", "b", "n", "m") ;

$allletters['Russian']= array("ё" , "й" , "ц" , "у" , "к" , "е" , "н" , "г" , "ш" , "щ" , "з" , "х" , "ъ" , "ф" , "ы" , "в" , "а" , "п" , "р" , "о" , "л" , "д" , "ж" , "э" , "я" , "ч" , "с" , "м" , "и" , "т" , "ь" , "б" , "ю" , "!" , "№") ;

$allletters['Spanish']= array("º" , "¡" , "q" , "w" , "e" , "r" , "t" , "y" , "u" , "i" , "o" , "p" , "ç" , "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l" , "ñ" , "z" , "x" , "c" , "v" , "b" , "n" , "m");

$allletters['Swedish']=  array("§" , "q" , "w" , "e" , "r" , "t" , "y" , "u" , "i" , "o" , "p" , "å" , "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l" , "ö" , "ä" , "z" , "x" , "c" , "v" , "b" , "n" , "m" , "ë" , "ÿ" , "ü" , "ï") ;
//arabic
$allletters['Arabic'] = array("ذ", "ض", "ص", "ث", "ق", "ف", "غ", "ع", "ه", "خ", "ح", "ج", "د", "ش", "س", "ي", "ب", "ل", "ا", "ت", "ن", "م", "ك", "ط", "ئ", "ء", "ؤ", "ر", "لا", "ى", "ة", "و", "ز", "ظ");

//albnian
$allletters['Albanian'] = array_merge( $en , array('ç','ë') );

//amharic
$allletters['Amharic'] = array("፩", "ሀ", "በ", "ነ", "መ", "ወ", "ጠ", "ተ", "ለ", "ረ", "የ" , "ኣ", "ኡ", "አ", "እ", "ኤ", "ኧ", "እ", "አ", "ኦ", "ኢ",  "ቐ", "ቀ", "ከ", "ደ", "ኸ", "ገ", "ሰ", "ቸ", "ዘ", "ፈ");

//armanian
$allletters['Armanian']  =array( "ձ", "յ", "օ", "ռ", "ժ", "խ", "վ", "է", "ր", "դ", "ե", "ը", "ի", "ո", "բ", "չ", "ջ", "'", "ա", "ս", "տ", "ֆ", "կ", "հ", "ճ", "ք", "լ", "թ", "փ", "'", "զ", "ց", "գ", "ւ", "պ", "ն", "մ", "շ", "ղ", "ծ");

//bangla
$allletters['bangla']=array( "ৃ", "ৌ", "ৈ", "া", "ী", "ূ", "ব", "হ", "গ", "দ", "জ", "ড", "়", "ো", "ে", "্", "ি", "ু", "প", "র", "ক", "ত", "চ", "ট",  "ম", "ন", "ব", "ল", "স",  "য");

//chineese
$allletters['Chinese']=array( "手", "田", "水", "口", "廿", "卜", "山", "戈", "人", "心",  "日", "尸", "木", "火", "土", "竹", "十", "大", "中", "Ｚ", "難", "金", "女", "月", "弓");

//coptic
$allletters['Coptic']=array( "⸗", "ⲑ", "ⲱ", "ⲉ", "ⲣ", "ⲧ", "ⲯ", "ⲩ", "ⲓ", "ⲟ", "ⲡ",  "̀", "ⲁ", "ⲥ", "ⲇ", "ⲫ", "ⲅ", "ⲏ", "ϫ", "ⲕ", "ⲗ",  "̀", "ⲍ", "ⲝ", "ⲭ", "ϣ", "ⲃ", "ⲛ", "ⲙ", "́");

//Croatian
$allletters['Croatian'] = array("q", "w", "e", "r", "t", "z", "u", "i", "o", "p", "š", "đ", "ž", "a", "s", "d", "f", "g", "h", "j", "k", "l", "č", "ć",  "y", "x", "c", "v", "b", "n", "m")  ;

//Czech
$allletters['Czech'] =  array(  "ě", "š", "č", "ř", "ž", "ý", "á", "í", "é" , "q", "w", "e", "r", "t", "z", "u", "i", "o", "p", "ú",   "¨", "a", "s", "d", "f", "g", "h", "j", "k", "l", "ů", "§" , "y", "x", "c", "v", "b", "n", "m"  );

//Danish
$allletters['Danish'] =array( "q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "å", "a", "s", "d", "f", "g", "h", "j", "k", "l", "æ", "ø",  "z", "x", "c", "v", "b", "n", "m" ,  "ë",   "ÿ", "ü", "ï", "ö", "ä") ;

//Dhivehi
$allletters['Dhivehi'] = array("ް", "އ", "ެ", "ރ", "ތ", "ޔ", "ު", "ި", "ޮ", "ޕ",  "ަ", "ސ", "ދ", "ފ", "ގ", "ހ", "ޖ", "ކ", "ލ",  "ޒ", "×", "ޗ", "ވ", "ބ", "ނ", "މ") ;


//Estonian
$allletters['Estonian']= array("ˇ", "q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "ü", "õ", "a", "s", "d", "f", "g", "h", "j", "k", "l", "ö", "ä", "z", "x", "c", "v", "b", "n", "m");

//Farsi
$allletters['Farsi'] = array("۴", "۵", "۶", "ض", "ص", "ث", "ق", "ف", "غ", "ع", "ه", "خ", "ح", "ج", "چ", "ش", "س", "ی", "ب", "ل", "ا", "ت", "ن", "م", "ک", "گ", "ظ", "ط", "ز", "ر", "ذ", "د", "پ", "و");

//Finnish
$allletters['Finnish'] = array("§","q","w","e","r","t","y","u","i","o","p","å","a","s","d","f","g","h","j","k","l","ö","ä","z","x","c","v","b","n","m","ë","ÿ","ü","ï","ö","ä");


//Georgian
$allletters['Georgian']= array("№", "§",  "ღ", "ჯ", "უ", "კ", "ე", "ნ", "გ", "შ", "წ", "ზ", "ხ", "ც", "ფ", "ძ", "ვ", "თ", "ა", "პ", "რ", "ო", "ლ", "დ", "ჟ", "(", "ჭ", "ჩ", "ყ", "ს", "მ", "ი", "ტ", "ქ", "ბ", "ჰ") ;

//Greek
$allletters['Greek']=array("ς", "ε", "ρ", "τ", "υ", "θ", "ι", "ο", "π", "α", "σ", "δ", "φ", "γ", "η", "ξ", "κ", "λ", "ζ", "χ", "ψ", "ω", "β", "ν", "μ") ;


//Gujarati
$allletters['Gujarati']= array( "ૃ", "ૌ", "ૈ", "ા", "ી", "ૂ", "બ", "હ", "ગ", "દ", "જ", "ડ", "઼", "ૉ", "ો", "ે", "્", "િ", "ુ", "પ", "ર", "ક", "ત", "ચ", "ટ",  "ં", "મ", "ન", "વ", "લ", "સ", "ય");

//Hindi
$allletters['Hindi']= array( "ृ", "ौ", "ै", "ा", "ी", "ू", "ब", "ह", "ग", "द", "ज", "ड", "़", "ॉ", "ो", "े", "्", "ि", "ु", "प", "र", "क", "त", "च", "ट", "ॉ", "ं", "म", "न", "व", "ल", "स", "य") ;

//Hungarian
$allletters['Hungarian']= array("ö", "ü", "ó", "q", "w", "e", "r", "t", "z", "u", "i", "o", "p", "ő", "ú", "ű", "a", "s", "d", "f", "g", "h", "j", "k", "l", "é", "á", "ű", "y", "x", "c", "v", "b", "n", "m") ;

//Irish
$allletters['Irish']= $en;

//Italian
$allletters['Italian']= $en;

//Japanese
$allletters['Japanese']= array("ろ", "ぬ", "ふ", "あ", "う", "え", "お", "や", "ゆ", "よ", "わ", "ほ", "へ", "た", "て", "い", "す", "か", "ん", "な", "に", "ら", "せ", "゛", "゜", "む", "ち", "と", "し", "は", "き", "く", "ま", "の", "り", "れ", "け", "む", "つ", "さ", "そ", "ひ", "こ", "み", "も", "ね", "る", "め");

//Kannada
$allletters['Kannada']= array("ೊ", "ೃ", "ೌ", "ೈ", "ಾ", "ೀ", "ೂ", "ಬ", "ಹ", "ಗ", "ದ", "ಜ", "ಡ",  "ೋ", "ೇ", "್", "ಿ", "ು", "ಪ", "ರ", "ಕ", "ತ", "ಚ", "ಟ", "ೆ", "ಂ", "ಮ", "ನ", "ವ", "ಲ", "ಸ", ",", ".", "ಯ", "ಒ", "ಃ", "ಋ", "ಔ", "ಐ", "ಆ", "ಈ", "ಊ", "ಭ", "ಙ", "ಘ", "ಧ", "ಝ", "ಢ", "ಞ", "ಓ", "ಏ", "ಅ", "ಇ", "ಉ", "ಫ", "ಱ", "ಖ", "ಥ", "ಛ", "ಠ", "ಎ", "ಣ", "ಳ", "ಶ", "ಷ");

//Kazakh
$allletters['Kazakh']= array("ә","і","ң","ғ",",",".","ү","ұ","қ","ө","һ","й","ц","у","к","е","н","г","ш","щ","з","х","ъ","ф","ы","в","а","п","р","о","л","д","ж","э","я","ч","с","м","и","т","ь","б","ю","№","!","Ә","І","Ң","Ғ","Ү","Ұ","Қ","Ө","Һ","Й","Ц","У","К","Е","Н","Г","Ш","Щ","З","Х","Ъ","Ф","Ы","В","А","П","Р","О","Л","Д","Ж","Э","Я","Ч","С","М","И","Т","Ь","Б","Ю") ;

//Khmer
$allletters['Khmer']= array("១","២","៣","៤","៥","៦","៧","៨","៩","០","គ","ធ","ឆ","ឹ","េ","រ","ត","យ","ុ","ិ","ោ","ផ","ៀ","ឨ","ឮ","ា","ស","ដ","ថ","ង","ហ","្","ក","ល","ើ","់","ឋ","ខ","ច","វ","ប","ន","ម","ំុ","។","៊​","៛","%","៌","័","៏","៝","ឪ","ឈ","ឺ","ែ","ឬ","ទ","ួ","ូ","ី","ៅ","ភ","ឿ","ឧ","ឭ","ាំ","ៃ","ឌ","ឣ","ះ","ញ","ឡ","ោៈ","៉","ឍ","ឃ","ជ","េះ","ព","ណ","ំ","ុះ","៕") ;

//Khowar
$allletters['Khowar']= array("ﺃ","۴","۵","۶","ق","و","ع","ر","ت","ے","ء","ی","ہ","پ","ئ","نگ","س","د","ف","گ","ح","ج","ک","ل","ز","ش","چ","ط","ب","ن","م","څ","ځ","ݲ","ڵ","ڑ","ٹ","ڇ","ڗ","ټ","ڂ","ڼ","ڠ","مﬞ","|","آ","ص","ڈ","ݯ","غ","ھ","ض","خ","ٷ",":","ذ","ژ","ث","ظ","ݱ","ڨ","ݰ","٫");

//Korean
$allletters['Korean']= array("ㅂ","ㅈ","ㄷ","ㄱ","ㅅ","ㅛ","ㅕ","ㅑ","ㅐ","ㅔ","ㅁ","ㄴ","ㅇ","ㄹ","ㅎ","ㅗ","ㅓ","ㅏ","ㅋ","ㅌ","ㅊ","ㅍ","ㅠ","ㅜ","ㅡ","ㅃ","ㅉ","ㄸ","ㄲ","ㅆ","ㅒ","ㅖ") ;

//Kurdish
$allletters['Kurdish']= array("١","وو","ي","ڕ","ط","ێ","ء","ح","ٶ","ث","|","آ","ش","ذ","إ","غ","أ","ك","ڵ","ض","ص","چ","ظ","ى","ة","ـ");

//Lao
$allletters['Lao']= array( "ຢ" , "ຟ" , "ໂ" , "ຖ" , "ຸ" , "ູ" , "ຄ" , "ຕ" , "ຈ" , "ຂ" , "ຊ" , "ໍ" , "ົ" , "ໄ" , "ຳ" , "ພ" , "ະ" , "ິ" , "ີ" , "ຮ" , "ນ" , "ຍ" , "ບ" , "ລ" , "“" , "ັ" , "ຫ" , "ກ" , "ດ" , "ເ" , "້" , "່" , "າ" , "ສ" , "ວ" , "ງ" , "ຜ" , "ປ" , "ແ" , "ອ" , "ຶ" , " ື" , "ທ" , "ມ" , "ໃ" , "ຝ" , "/" , "໑" , "໒" , "໓" , "໔" , "໌" , "ຼ" , "໕" , "໖" , "໗" , "໘" , "໙" , "ໍ່" , "ົ້" , "໐" , "ຳ້"  , "ິ້" , "ີ້" , "ຣ" , "ໜ" , "ຽ" , "ຫຼ" , "ັ້" , "໊" , "໋", "₭" , "(" , "ຯ"  , "ຶ້" , "ື້" , "ໆ" , "ໝ" ) ;


//Latvian
$allletters['Latvian']= array( "f" , "ū" , "g" , "j" , "r" , "m" , "v" , "n" , "z" , "ē" , "č" , "ž" , "h" , "ķ" , "š" , "u" , "s" , "i" , "l" , "d" , "a" , "t" , "e" , "c" , "ģ" , "ņ" , "b" , "ī" , "k" , "p" , "o" , "ā" , "ļ" ) ;

//Lithuanian
$allletters['Lithuanian']= array( "ą" , "č" , "ę" , "ė" , "į" , "š" , "ų" , "ū"   , "ž" , "q" , "w" , "e" , "r" , "t" , "y" , "u" , "i" , "o" , "p" ,  "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l"  , "z" , "x" , "c" , "v" , "b" , "n" , "m" );


$allletters['Malayalam']= array("ൊ"  , "ൃ" , "ൌ" , "ൈ" , "ാ" , "ീ" , "ൂ" , "ബ" , "ഹ" , "ഗ" , "ദ" , "ജ" , "ഡ" , "c"  , "ോ" , "േ" , "്" , "ി" , "ു" , "പ" , "ര" , "ക" , "ത" , "ച" , "ട" , "െ" , "ം" , "മ" , "ന" , "വ" , "ല" , "സ" , "," , "." , "യ" , "ഒ"  , "ഃ" , "ഋ" , "ഔ" , "ഐ" , "ആ" , "ഈ" , "ഊ" , "ഭ" , "ങ" , "ഘ" , "ധ" , "ഝ" , "ഢ" , "ഞ" , "ഓ" , "ഏ" , "അ" , "ഇ" , "ഉ" , "ഫ" , "റ" , "ഖ" , "ഥ" , "ഛ" , "ഠ" , "എ" , "ണ" , "ഴ" , "ള" , "ശ" , "ഷ");

$allletters['Marathi']= array( "१" , "२" , "३" , "४" , "५" , "६" , "७" , "८" , "९" , "०"  , "ृ" , "ौ" , "ै" , "ा" , "ी" , "ू" , "ब" , "ह" , "ग" , "द" , "ज" , "ड" , "़" , "ॉ" , "ो" , "े" , "्" , "ि" , "ु" , "प" , "र" , "क" , "त" , "च" , "ट" , "ं" , "म" , "न" , "व" , "ल" , "स"   , "य" , "ऍ" , "ॅ" , "ः" , "ऋ" , "औ" , "ऐ" , "आ" , "ई" , "ऊ" , "भ" , "ङ" , "घ" , "ध" , "झ" , "ढ" , "ञ" , "ऑ" , "ओ" , "ए" , "अ" , "इ" , "उ" , "फ" , "ऱ" , "ख" , "थ" , "छ" , "ठ" , "ँ" , "ण" , "ळ" , "श" , "ष"   , "य़") ;

$allletters['Nepali']= array("ञ" , "घ" , "ङ" , "झ" , "छ" , "ट" , "ठ" , "ड" , "ढ" , "ण" , "ध" , "भ" , "च" , "त" , "थ" , "ग" , "ष" , "य" , "उ" , "ृ" , "े" , "ब" , "क" , "म" , "ा" , "न" , "ज" , "व" , "प" , "ि" , "स" , "ु" , "श" , "ह" , "अ" , "ख" , "द" , "ल" , "फ" , "र" , "१" , "२" , "३" , "४" , "५" , "६" , "७" , "८" , "९" , "०" , "ं" , "ो" , "इ" , "ए" , "ै" , "्" , "ँ" , "ी" , "ू" , "ऋ");

$allletters['Norwegian']= array("q" , "w" , "e" , "r" , "t" , "y" , "u" , "i" , "o" , "p" , "å" , "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l" , "ø" , "æ" , "z" , "x" , "c" , "v" , "b" , "n" , "m" , "§");

$allletters['Oriya']= array("ୃ" , "ୌ" , "ୈ" , "ା" , "ୀ" , "ୂ" , "ବ" , "ହ" , "ଗ" , "ଦ" , "ଜ" , "ଡ" , "଼" , "ୋ" , "େ" , "୍" , "ି" , "ୁ" , "ପ" , "ର" , "କ" , "ତ" , "ଚ" , "ଟ" , "ୟ" , "ଂ" , "ମ" , "ନ" , "ଲ" , "ସ" , "ଯ" , "@" , "୍ର" , "ର୍" , "ଜ୍ଞ" , "ତ୍ର" , "କ୍ଷ" , "ଶ୍ର" , "(" , ")" , "ଃ" , "ଋ" , "ଔ" , "ଐ" , "ଆ" , "ଈ" , "ଊ" , "ଭ" , "ଙ" , "ଘ" , "ଧ" , "ଝ" , "ଢ" , "ଞ" , "|" , "ଓ" , "ଏ" , "ଅ" , "ଇ" , "ଉ" , "ଫ" , "j" , "ଖ" , "ଥ" , "ଛ" , "ଠ" , "ୱ" , "ଁ" , "ଣ" , "v" , "b" , "ଳ" , "ଶ" , "ଷ" , "ଯ଼") ;

$allletters['Polish']= array("q" , "w" , "e" , "r" , "t" , "z" , "u" , "i" , "o" , "p" , "ż" , "ś" , "ó" , "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l" , "ł" , "ą" , "y" , "x" , "c" , "v" , "b" , "n" , "m" , "ń" , "ć" , "ź" , "ę");

$allletters['Punjabi']= array(  "ੌ", "ੈ", "ਾ", "ੀ", "ੂ", "ਬ", "ਹ", "ਗ", "ਦ", "ਜ", "ਡ", "਼" , "ੋ", "ੇ", "੍", "ਿ", "ੁ", "ਪ", "ਰ", "ਕ", "ਤ", "ਚ", "ਟ" , "ੰ", "ਮ", "ਨ", "ਵ", "ਲ", "ਸ" , "ਯ" , "ੱ" ,   "ਔ", "ਐ", "ਆ", "ਈ", "ਊ", "ਭ", "ਙ", "ਘ", "ਧ", "ਝ", "ਢ", "ਞ" , "ਓ", "ਏ", "ਅ", "ਇ", "ਉ", "ਫ" , "ਖ", "ਥ", "ਛ", "ਠ"  , "ਂ", "ਣ" , "ੲ", "ਲ਼", "ਸ਼"     ) ;

$allletters['Romanian']= array("q" , "w" , "e" , "r" , "t" , "y" , "u" , "i" , "o" , "p" , "ă" , "î" , "â" , "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l" , "ș" , "ț" , "z" , "x" , "c" , "v" , "b" , "n" , "m");

$allletters['Sinhala']= array("්‍ර" , "ු" , "අ" , "ැ" , "ර" , "ඒ" , "හ" , "ම" , "ස" , "ද" , "ච" , "ඤ" , "්" , "ි" , "ා" , "ෙ" , "ට" , "ය" , "ව" , "න" , "ක" , "ත" , "ං" , "ජ" , "ඩ" , "ඉ" , "බ" , "ප" , "ල" , "ග" , "/" , "ර්‍" , "ූ" , "උ" , "ෑ" , "ඍ" , "ඔ" , "ශ" , "ඹ" , "ෂ" , "ධ" , "ඡ" , "ඥ" , "ෟ" , "ී" , "ෘ" , "ෆ" , "ඨ" , "්‍ය" , "ළු" , "ණ" , "ඛ" , "ථ" , "ඃ" , "ඣ" , "ඪ" , "ඊ" , "භ" , "ඵ" , "ළ" , "ඝ")  ;

$allletters['Slovak']= array("ľ" , "š" , "č" , "ť" , "ž" , "ý" , "á" , "í" , "é" , "q" , "w" , "e" , "r" , "t" , "z" , "u" , "i" , "o" , "p" , "ú" , "ä" , "ň" , "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l" , "ô" , "§" , "y" , "x" , "c" , "v" , "b" , "n" , "m") ;

$allletters['Slovenian']= array("q" , "w" , "e" , "r" , "t" , "z" , "u" , "i" , "o" , "p" , "š" , "đ" , "ž" , "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l" , "č" , "ć" , "y" , "x" , "c" , "v" , "b" , "n" , "m");


$allletters['Tamil']= array( "ஆ", "ஈ", "ஊ", "ஐ", "ஏ", "ள", "ற", "ன", "ட", "ண", "ச", "ஞ" , "அ", "இ", "உ", "்", "எ", "க", "ப", "ம", "த", "ந", "ய" , "ஔ", "ஓ", "ஒ", "வ", "ங", "ல", "ர" , "ஸ", "ஷ", "ஜ", "ஹ", "க்ஷ", "ஸ்ரீ", "ஶ", "i" , "௹", "௺", "௸", "ஃ", "g", "h", "j" , "௳", "௴", "௵", "௶", "௷", "n") ;

$allletters['Telugu']= array(  "ృ", "ౌ", "ై", "ా", "ీ", "ూ", "బ", "హ", "గ", "ద", "జ", "డ"  , "ో", "ే", "్", "ి", "ు", "ప", "ర", "క", "త", "చ", "ట" , "ె", "ం", "మ", "న", "వ", "ల", "స" , "య", "ఒ" , "ఋ", "ఔ", "ఐ", "ఆ", "ఈ", "ఊ", "భ", "ఙ", "ఘ", "ధ", "ఝ", "ఢ", "ఞ", "ఓ", "ఏ", "అ", "ఇ", "ఉ", "ఫ", "ఱ", "ఖ", "థ", "ఛ", "ఠ", "ఎ", "ఁ", "ణ", "న" ,"ళ", "శ", "ష");

$allletters['Tibetan']=array("ཨ" , "༡" , "༢" , "༣" , "༤" , "༥" , "༦" , "༧" , "༨" , "༩" , "༠" , "ཧ" , "ཝ" , "ཅ" , "ཆ" , "ེ" , "ར" , "ཏ" , "ཡ" , "ུ" , "ི" , "ོ" , "ཕ" , "ཙ" , "ཚ" , "ཛ" , "འ" , "ས" , "ད" , "བ" , "ང" , "མ" , "་" , "ག" , "ལ" , "ཞ" , "།" , "ཟ" , "ཤ" , "ཀ" , "ཁ" , "པ" , "ན" , "྅" , "ཐ" , "ཇ" , "ཉ" , "༁" , "༪" , "༫" , "༬" , "༭" , "༮" , "༯" , "༰" , "༱" , "༲" , "༳" , "༼" , "༽" , "༕" , "༖" , "༗" , "ྼ" , "ཊ" , "ྻ" , "༘" , "༙" , "ཌ" , "༾" , "༿" , "࿏" , "༂" , "༃" , "༆" , "༇" , "༸" , "༞" , "༴" , "ཥ" , "ཀྵ" , "ཎ" , "༹" , "ཋ" , "༺" , "༻") ;

$allletters['Thai']= array(  "ภ", "ถ", "ุ", "ึ", "ค", "ต", "จ", "ข", "ช", "ๆ", "ไ", "ำ", "พ", "ะ", "ั", "ี", "ร", "น", "ย", "บ", "ล", "ฃ", "ฟ", "ห", "ก", "ด", "เ", "้", "่", "า", "ส", "ว", "ง", "ฃ", "ผ", "ป", "แ", "อ", "ิ", "ื", "ท", "ม", "ใ", "ฝ" , "๑", "๒", "๓", "๔", "ู", "฿", "๕", "๖", "๗", "๘", "๙", "๐" , "ฎ", "ฑ", "ธ", "ํ", "๊", "ณ", "ฯ", "ญ", "ฐ" , "ฅ", "ฤ", "ฆ", "ฏ", "โ", "ฌ", "็", "๋", "ษ", "ศ", "ซ" , "ฅ" , "ฉ", "ฮ", "ฺ", "์" , "ฒ", "ฬ", "ฦ");

$allletters['Turkish']= array(  "q", "w", "e", "r", "t", "y", "u", "ı", "o", "p", "ğ", "ü",  "a", "s", "d", "f", "g", "h", "j", "k", "l", "ş", "i" , "z", "x", "c", "v", "b", "n", "m", "ö", "ç" , "é"  , "q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "ğ", "ü" , "a", "s", "d", "f", "g", "h", "j", "k", "l", "ş", "i",  "z", "x", "c", "v", "b", "n", "m", "ö", "ç" );

$allletters['Urdu']= array("ط" , "ص" , "ھ" , "د" , "ٹ" , "پ" , "ت" , "ب" , "ج" , "ح" , "م" , "و" , "ر" , "ن" , "ل" , "ا" , "ک" , "ی" , "ق" , "ف" , "س" , "ش" , "غ" , "ع" , "ظ" , "ض" , "ذ" , "ڈ" , "ث" , "چ" , "خ" , "ژ" , "ز" , "ڑ" , "ں" , "ء" , "آ" , "گ" , "ي" , "ۓ" , "‎" , "ؤ" , "ئ"  );

$allletters['Ukrainian']=array("й" , "ц" , "у" , "к" , "е" , "н" , "г" , "ш" , "щ" , "з" , "х" , "ї" , "ф" , "і" , "в" , "а" , "п" , "р" , "о" , "л" , "д" , "ж" , "є" , "ґ" , "я" , "ч" , "с" , "м" , "и" , "т" , "ь" , "б" , "ю" , "₴" , "№");
$allletters['Uzbek']=array("ё" , "ғ", "ҳ", "й", "ц", "у", "к", "е", "н", "г", "ш", "ў", "з", "х", "ъ", "ф", "қ", "в", "а", "п", "р", "о", "л", "д", "ж", "э" , "я", "ч", "с", "м", "и", "т", "ь", "б", "ю" , "ё" , "№"  , "ғ", "ҳ", "й", "ц", "у", "к", "е", "н", "г", "ш", "ў", "з", "х",    "ф", "қ", "в", "а", "п", "р", "о", "л", "д", "ж", "э" , "я", "ч", "с", "м", "и", "т", "ь", "б", "ю" );

$allletters['Vietnamese'] = array("ă" , "â" , "ê" , "ô" , "̀" , "̉" , "̃" , "́" , "̣" , "đ" , "₫" , "q" , "w" , "e" , "r" , "t" , "y" , "u" , "i" , "o" , "p" , "ư" , "ơ" , "a" , "s" , "d" , "f" , "g" , "h" , "j" , "k" , "l" , "z" , "x" , "c" , "v" , "b" , "n" , "m");

//Portuguese
$allletters['Portuguese'] = array("a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z","ç","ã","õ","é","à","ó","á","í","ê","ú"); 

